In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.019239  0.483094 -0.183524 -0.410832
2013-01-02 -0.428083  0.039665  0.643943  0.128824
2013-01-03  0.004159 -0.288828 -1.838721  0.903923
2013-01-04  0.400133  0.829386 -0.409819 -0.570156
2013-01-05 -0.653521  1.188075 -1.460784  0.137303
2013-01-06 -0.631423 -0.886992  0.736713  0.416202

In [5]:
df2 = pd.DataFrame({
    "A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo",
})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.019239  0.483094 -0.183524 -0.410832
2013-01-02 -0.428083  0.039665  0.643943  0.128824
2013-01-03  0.004159 -0.288828 -1.838721  0.903923
2013-01-04  0.400133  0.829386 -0.409819 -0.570156
2013-01-05 -0.653521  1.188075 -1.460784  0.137303

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.400133  0.829386 -0.409819 -0.570156
2013-01-05 -0.653521  1.188075 -1.460784  0.137303
2013-01-06 -0.631423 -0.886992  0.736713  0.416202

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.to_numpy()

array([[-0.01923914,  0.48309357, -0.18352377, -0.41083202],
       [-0.42808331,  0.03966542,  0.64394284,  0.12882408],
       [ 0.00415929, -0.28882806, -1.83872121,  0.9039231 ],
       [ 0.40013319,  0.82938612, -0.40981863, -0.57015589],
       [-0.65352105,  1.18807499, -1.46078403,  0.1373026 ],
       [-0.63142312, -0.88699188,  0.73671313,  0.41620194]])

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.221329  0.227400 -0.418699  0.100877
std    0.418477  0.760824  1.060375  0.540102
min   -0.653521 -0.886992 -1.838721 -0.570156
25%   -0.580588 -0.206705 -1.198043 -0.275918
50%   -0.223661  0.261379 -0.296671  0.133063
75%   -0.001690  0.742813  0.437076  0.346477
max    0.400133  1.188075  0.736713  0.903923

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.019239   -0.428083    0.004159    0.400133   -0.653521   -0.631423
B    0.483094    0.039665   -0.288828    0.829386    1.188075   -0.886992
C   -0.183524    0.643943   -1.838721   -0.409819   -1.460784    0.736713
D   -0.410832    0.128824    0.903923   -0.570156    0.137303    0.416202

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.410832 -0.183524  0.483094 -0.019239
2013-01-02  0.128824  0.643943  0.039665 -0.428083
2013-01-03  0.903923 -1.838721 -0.288828  0.004159
2013-01-04 -0.570156 -0.409819  0.829386  0.400133
2013-01-05  0.137303 -1.460784  1.188075 -0.653521
2013-01-06  0.416202  0.736713 -0.886992 -0.631423

In [16]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06 -0.631423 -0.886992  0.736713  0.416202
2013-01-03  0.004159 -0.288828 -1.838721  0.903923
2013-01-02 -0.428083  0.039665  0.643943  0.128824
2013-01-01 -0.019239  0.483094 -0.183524 -0.410832
2013-01-04  0.400133  0.829386 -0.409819 -0.570156
2013-01-05 -0.653521  1.188075 -1.460784  0.137303

In [17]:
df["A"]

2013-01-01   -0.019239
2013-01-02   -0.428083
2013-01-03    0.004159
2013-01-04    0.400133
2013-01-05   -0.653521
2013-01-06   -0.631423
Freq: D, Name: A, dtype: float64

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.019239  0.483094 -0.183524 -0.410832
2013-01-02 -0.428083  0.039665  0.643943  0.128824
2013-01-03  0.004159 -0.288828 -1.838721  0.903923

In [19]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.428083  0.039665  0.643943  0.128824
2013-01-03  0.004159 -0.288828 -1.838721  0.903923
2013-01-04  0.400133  0.829386 -0.409819 -0.570156

In [20]:
df.loc[dates[0]]

A   -0.019239
B    0.483094
C   -0.183524
D   -0.410832
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.019239  0.483094
2013-01-02 -0.428083  0.039665
2013-01-03  0.004159 -0.288828
2013-01-04  0.400133  0.829386
2013-01-05 -0.653521  1.188075
2013-01-06 -0.631423 -0.886992

In [22]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.428083  0.039665
2013-01-03  0.004159 -0.288828
2013-01-04  0.400133  0.829386

In [23]:
df.loc["20130102", ["A", "B"]]

A   -0.428083
B    0.039665
Name: 2013-01-02 00:00:00, dtype: float64

In [24]:
df.loc[dates[0], "A"]

-0.01923914227999477

In [25]:
df.at[dates[0], "A"]

-0.01923914227999477

In [26]:
df.iloc[3]

A    0.400133
B    0.829386
C   -0.409819
D   -0.570156
Name: 2013-01-04 00:00:00, dtype: float64

In [27]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.400133  0.829386
2013-01-05 -0.653521  1.188075

In [28]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.428083  0.643943
2013-01-03  0.004159 -1.838721
2013-01-05 -0.653521 -1.460784

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.483094 -0.183524
2013-01-02  0.039665  0.643943
2013-01-03 -0.288828 -1.838721
2013-01-04  0.829386 -0.409819
2013-01-05  1.188075 -1.460784
2013-01-06 -0.886992  0.736713

In [30]:
df.iloc[1, 1]

0.03966542196122663

In [31]:
df.iat[1, 1]

0.03966542196122663

In [32]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-03  0.004159 -0.288828 -1.838721  0.903923
2013-01-04  0.400133  0.829386 -0.409819 -0.570156

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.483094       NaN       NaN
2013-01-02       NaN  0.039665  0.643943  0.128824
2013-01-03  0.004159       NaN       NaN  0.903923
2013-01-04  0.400133  0.829386       NaN       NaN
2013-01-05       NaN  1.188075       NaN  0.137303
2013-01-06       NaN       NaN  0.736713  0.416202

In [34]:
df2 = df.copy()

df2["E"] = ["one", "one", "two", "three", "four", "three"]

df2

                   A         B         C         D      E
2013-01-01 -0.019239  0.483094 -0.183524 -0.410832    one
2013-01-02 -0.428083  0.039665  0.643943  0.128824    one
2013-01-03  0.004159 -0.288828 -1.838721  0.903923    two
2013-01-04  0.400133  0.829386 -0.409819 -0.570156  three
2013-01-05 -0.653521  1.188075 -1.460784  0.137303   four
2013-01-06 -0.631423 -0.886992  0.736713  0.416202  three

In [35]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.004159 -0.288828 -1.838721  0.903923   two
2013-01-05 -0.653521  1.188075 -1.460784  0.137303  four

In [36]:
s1 = pd.Series(
    [1, 2, 3, 4, 5, 6],
    index=pd.date_range("20130102", periods=6)
)
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [37]:
df.at[dates[0], "A"] = 0

In [38]:
df.iat[0, 1] = 0

In [40]:
df.loc[:, "D"] = np.array([5] * len(df))

In [41]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.183524  5
2013-01-02 -0.428083  0.039665  0.643943  5
2013-01-03  0.004159 -0.288828 -1.838721  5
2013-01-04  0.400133  0.829386 -0.409819  5
2013-01-05 -0.653521  1.188075 -1.460784  5
2013-01-06 -0.631423 -0.886992  0.736713  5

In [43]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.183524 -5
2013-01-02 -0.428083 -0.039665 -0.643943 -5
2013-01-03 -0.004159 -0.288828 -1.838721 -5
2013-01-04 -0.400133 -0.829386 -0.409819 -5
2013-01-05 -0.653521 -1.188075 -1.460784 -5
2013-01-06 -0.631423 -0.886992 -0.736713 -5

In [44]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.183524  5  1.0
2013-01-02 -0.428083  0.039665  0.643943  5  1.0
2013-01-03  0.004159 -0.288828 -1.838721  5  NaN
2013-01-04  0.400133  0.829386 -0.409819  5  NaN

In [45]:
df1.dropna(how="any")

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.183524  5  1.0
2013-01-02 -0.428083  0.039665  0.643943  5  1.0

In [46]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.183524  5  1.0
2013-01-02 -0.428083  0.039665  0.643943  5  1.0
2013-01-03  0.004159 -0.288828 -1.838721  5  5.0
2013-01-04  0.400133  0.829386 -0.409819  5  5.0

In [47]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [48]:
df.mean()

A   -0.218123
B    0.146884
C   -0.418699
D    5.000000
dtype: float64

In [49]:
df.mean(1)

2013-01-01    1.204119
2013-01-02    1.313881
2013-01-03    0.719153
2013-01-04    1.454925
2013-01-05    1.018442
2013-01-06    1.054575
Freq: D, dtype: float64

In [50]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [51]:
df.sub(s, axis="index")

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -0.995841 -1.288828 -2.838721  4.0
2013-01-04 -2.599867 -2.170614 -3.409819  2.0
2013-01-05 -5.653521 -3.811925 -6.460784  0.0
2013-01-06       NaN       NaN       NaN  NaN

In [52]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000 -0.183524   5
2013-01-02 -0.428083  0.039665  0.460419  10
2013-01-03 -0.423924 -0.249163 -1.378302  15
2013-01-04 -0.023791  0.580223 -1.788121  20
2013-01-05 -0.677312  1.768298 -3.248905  25
2013-01-06 -1.308735  0.881307 -2.512192  30

In [53]:
df.apply(lambda x: x.max() - x.min())

A    1.053654
B    2.075067
C    2.575434
D    0.000000
dtype: float64

In [54]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    6
2    6
3    6
4    4
5    6
6    2
7    1
8    3
9    4
dtype: int32

In [55]:
s.value_counts()

6    4
2    2
4    2
1    1
3    1
dtype: int64

In [56]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [57]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -1.504048  1.388559 -1.375361 -0.682398
1 -0.255805  1.185743 -0.383597 -0.122028
2 -0.764366  0.505353  0.956253  0.105924
3  0.192912  0.175638 -0.457986  0.658633
4  0.647104  1.493027 -0.468468 -0.805459
5  0.957734 -2.254565  1.406889  1.967212
6  1.175430 -0.109615 -0.339180 -0.762830
7  0.813631 -0.989612  0.012409 -0.822911
8  1.255314 -0.670157  1.678526 -1.147756
9 -1.041885 -1.676342  0.557711  0.171967

In [58]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -1.504048  1.388559 -1.375361 -0.682398
 1 -0.255805  1.185743 -0.383597 -0.122028
 2 -0.764366  0.505353  0.956253  0.105924,
           0         1         2         3
 3  0.192912  0.175638 -0.457986  0.658633
 4  0.647104  1.493027 -0.468468 -0.805459
 5  0.957734 -2.254565  1.406889  1.967212
 6  1.175430 -0.109615 -0.339180 -0.762830,
           0         1         2         3
 7  0.813631 -0.989612  0.012409 -0.822911
 8  1.255314 -0.670157  1.678526 -1.147756
 9 -1.041885 -1.676342  0.557711  0.171967]

In [59]:
pd.concat(pieces)

          0         1         2         3
0 -1.504048  1.388559 -1.375361 -0.682398
1 -0.255805  1.185743 -0.383597 -0.122028
2 -0.764366  0.505353  0.956253  0.105924
3  0.192912  0.175638 -0.457986  0.658633
4  0.647104  1.493027 -0.468468 -0.805459
5  0.957734 -2.254565  1.406889  1.967212
6  1.175430 -0.109615 -0.339180 -0.762830
7  0.813631 -0.989612  0.012409 -0.822911
8  1.255314 -0.670157  1.678526 -1.147756
9 -1.041885 -1.676342  0.557711  0.171967

In [65]:
left = pd.DataFrame({
    "key": ["foo", "bar"],
    "lval": [1, 2]
})

right = pd.DataFrame({
    "key": ["foo", "bar"],
    "rval": [4, 5]
})

In [66]:
left

   key  lval
0  foo     1
1  bar     2

In [68]:
right

   key  rval
0  foo     4
1  bar     5

In [69]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [70]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one  0.559465  0.280785
1  bar    one -1.174419  0.008389
2  foo    two  0.274248  1.032858
3  bar  three  0.842511 -0.577640
4  foo    two -2.675068 -0.834137
5  bar    two  1.539052 -0.240666
6  foo    one  0.248120  0.166791
7  foo  three  0.783627  0.812610

In [71]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  1.207144 -0.809917
foo -0.809608  1.458907

In [72]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -1.174419  0.008389
    three  0.842511 -0.577640
    two    1.539052 -0.240666
foo one    0.807585  0.447575
    three  0.783627  0.812610
    two   -2.400820  0.198722

In [73]:
tuples = list(
    zip(
        ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
        ["one", "two", "one", "two", "one", "two", "one", "two"],
    )
)

index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
df2 = df[:4]
df2

                     A         B
first second
bar   one    -1.241002 -1.035564
      two    -0.981863 -0.221787
baz   one     0.301276  1.838188
      two     0.025283 -1.226389

In [74]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -1.241002
               B   -1.035564
       two     A   -0.981863
               B   -0.221787
baz    one     A    0.301276
               B    1.838188
       two     A    0.025283
               B   -1.226389
dtype: float64

In [75]:
stacked.unstack()

                     A         B
first second
bar   one    -1.241002 -1.035564
      two    -0.981863 -0.221787
baz   one     0.301276  1.838188
      two     0.025283 -1.226389

In [76]:
stacked.unstack(1)

second        one       two
first
bar   A -1.241002 -0.981863
      B -1.035564 -0.221787
baz   A  0.301276  0.025283
      B  1.838188 -1.226389

In [77]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.241002  0.301276
       B -1.035564  1.838188
two    A -0.981863  0.025283
       B -0.221787 -1.226389

In [78]:
df = pd.DataFrame({
    "A": ["one", "one", "two", "three"] * 3,
    "B": ["A", "B", "C"] * 4,
    "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
    "D": np.random.randn(12),
    "E": np.random.randn(12),
})
df

        A  B    C         D         E
0     one  A  foo  1.684387 -0.372474
1     one  B  foo -0.661807 -1.540846
2     two  C  foo -1.120681  0.803251
3   three  A  bar  0.072531 -1.364251
4     one  B  bar -2.344460 -1.031070
5     one  C  bar  0.159269 -0.216332
6     two  A  foo -1.096575 -1.607523
7   three  B  foo -1.187800  0.007610
8     one  C  foo  1.612678 -0.767971
9     one  A  bar -0.139308 -0.824259
10    two  B  bar -2.176467  0.809510
11  three  C  bar  1.246758 -0.805673

In [79]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A -0.139308  1.684387
      B -2.344460 -0.661807
      C  0.159269  1.612678
three A  0.072531       NaN
      B       NaN -1.187800
      C  1.246758       NaN
two   A       NaN -1.096575
      B -2.176467       NaN
      C       NaN -1.120681

In [80]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

2012-01-01    23522
Freq: 5T, dtype: int32

In [81]:
rng = pd.date_range("3/6/2012", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    0.808839
2012-03-07    0.433037
2012-03-08   -0.881717
2012-03-09    0.787497
2012-03-10   -0.708646
Freq: D, dtype: float64

In [82]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00    0.808839
2012-03-07 00:00:00+00:00    0.433037
2012-03-08 00:00:00+00:00   -0.881717
2012-03-09 00:00:00+00:00    0.787497
2012-03-10 00:00:00+00:00   -0.708646
Freq: D, dtype: float64

In [83]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    0.808839
2012-03-06 19:00:00-05:00    0.433037
2012-03-07 19:00:00-05:00   -0.881717
2012-03-08 19:00:00-05:00    0.787497
2012-03-09 19:00:00-05:00   -0.708646
Freq: D, dtype: float64

In [84]:
rng = pd.date_range("1/1/2012", periods=5, freq="M")
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31    0.686937
2012-02-29   -1.552699
2012-03-31    0.356163
2012-04-30    0.639834
2012-05-31    1.032844
Freq: M, dtype: float64

In [85]:
ps = ts.to_period()
ps

2012-01    0.686937
2012-02   -1.552699
2012-03    0.356163
2012-04    0.639834
2012-05    1.032844
Freq: M, dtype: float64

In [86]:
ps.to_timestamp()

2012-01-01    0.686937
2012-02-01   -1.552699
2012-03-01    0.356163
2012-04-01    0.639834
2012-05-01    1.032844
Freq: MS, dtype: float64